In [1]:
import pandas as pd

In [2]:
cities_df = pd.read_csv('codeit/world_cities.csv')
cities_df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [3]:
cities_df['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [4]:
cities_df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [6]:
cities_df['City / Urban area'].describe()

count              249
unique             249
top       Buenos Aires
freq                 1
Name: City / Urban area, dtype: object

In [7]:
cities_df['City / Urban area'].value_counts()

Buenos Aires            1
Bridgeport//Stamford    1
San Diego               1
Baltimore               1
Cincinnati              1
                       ..
Osaka/Kobe/Kyoto        1
Fukuoka                 1
Sapporo                 1
Kuwait                  1
Harare                  1
Name: City / Urban area, Length: 249, dtype: int64

In [8]:
cities_df['City / Urban area'].value_counts().shape

(249,)

In [9]:
cities_df['Country'].value_counts().shape

(61,)

In [11]:
cities_df[(cities_df['Population']/cities_df['Land area (in sqKm)']) > 10000].value_counts().shape

(19,)

In [19]:
cities_df["Density"] = cities_df["Population"] / cities_df["Land area (in sqKm)"]

In [31]:
cities_df.sort_values(by='Density', ascending=False)

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),Density
75,75,Mumbai,India,14350000,484,29648.760331
74,74,Kolkata,India,12700000,531,23917.137476
101,101,Karachi,Pakistan,9800000,518,18918.918919
99,99,Lagos,Nigeria,13400000,738,18157.181572
34,34,Shenzhen,China,8000000,466,17167.381974
...,...,...,...,...,...,...
194,195,Chattanooga,USA,344000,751,458.055925
223,224,Asheville,USA,222000,536,414.179104
57,57,Pau,France,181000,450,402.222222
220,221,Hickory,USA,188000,546,344.322344
196,197,Barnstable Town,USA,244000,741,329.284750

In [57]:
att = cities_df['Country'].value_counts()

In [58]:
att[att == 4]

Italy    4
Name: Country, dtype: int64